#include <iostream>

using namespace std;

/*
  二维数组的定义方式：
    1. 数据类型 数组名[行数][列数];
    2. 数据类型 数组名[行数][列数] = {{},{}};
    3. 数据类型 数组名[][列数] = {};
*/
int main6()
{
  // 1. 数据类型 数组名[行数][列数];
  int arr[2][3];
  arr[0][0] = 1;
  arr[0][1] = 2;
  arr[0][2] = 3;
  arr[1][0] = 4;
  arr[1][1] = 5;
  arr[1][2] = 6;
  for (int i = 0; i < 2; i++)
  {
    for (int j = 0; j < 3; j++)
      cout << arr[i][j] << "\t";
    cout << endl;
  }
  // 2. 数据类型 数组名[行数][列数] = {{},{}};
  int arr2[2][3] = {
                  {1, 2, 3},
                  {4, 5, 6}
          };
  // 3. 数据类型 数组名[][列数] = {};
  int arr3[2][3] = {1,2,3,4,5,6};
  return 0;
}